RhinoInside.Revit API Documentation
GeometryDecoder.ToPolylineCurve Method
 Converts the specified PolyLine to an equivalent Rhino PolylineCurve.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8016
Syntax
public static PolylineCurve ToPolylineCurve(
	this PolyLine value
)
Parameters
value
Type: PolyLine
A value to convert.
Return Value
Type: PolylineCurve
A Rhino PolylineCurve that is equivalent to the provided value.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type PolyLine. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
GeometryDecoder Class
RhinoInside.Revit.Convert.Geometry Namespace